{"channel id": "UCRvUQd-GsCR97qKReTE89jQ", "video_ids": [{"vid": "6HbQznTtpdc", "title": "A.US \"Voices\" Drop The Chamber - National", "channel_id": "UCRvUQd-GsCR97qKReTE89jQ", "category": "Nonprofits & Activism", "keywords": [], "description": "", "duration": "30", "publish_date": "2021-06-15", "snapshot_pt_time": "2022-05-29-17", "is_streamed": false, "view_count": "205", "num_like": 0, "num_dislike": 0, "lang": "NA", "transcript": "our democracy and voting rights are under attack corporate ceos promise to stand up for our rights at the ballot box but behind closed doors they're at the table with a powerful voice on voter suppression the u.s chamber of commerce you can't both be in favor of voting rights and be a member of this organization that is whipping senators votes against voting rights you can't do both tell corporate leaders you can't be with us if you're still with them drop the chamber ", "num_comment": 1, "comment_list": "NA", "top_comment_list": [{"author_id": "UCtDfSIKW6hDZQ9B7fOttqKA", "author_name": "Charlie Chan", "comment": "LOL who are Arabella advisors and where are the sources of money of New Venture Fund?", "published_date": "10 months ago", "num_of_replies": null}]}]}
{"channel id": "UC7yoXZ7c8ZZAimgcqHBtHoQ", "video_ids": [{"vid": "T-0qtsQKUbA", "title": "Now Patriotic Conservatives Are Killing Veterans 'To Own The Libs'!", "channel_id": "UC7yoXZ7c8ZZAimgcqHBtHoQ", "category": "News & Politics", "keywords": ["act.tv", "progressive", "media", "company", "activist", "activism", "lefty", "politics", "democratic socialism", "COVID", "vaccine", "vaccination", "low", "rate", "states", "hospitals", "ICU beds", "crowded", "full", "overflowing", "freedom", "refuse", "anti", "mask", "mandates", "patriots", "waiting", "treatment", "postpone", "cancel", "surgeries", "procedures", "no room", "public health", "crisis", "pandemic", "delta", "variant", "hospitalization", "rates", "increasing", "JamesFromTheInternet", "snark", "sarcasm"], "description": "With no ICU beds available in most southern states due to the influx of patriotic Americans who are exercising their freedoms by not getting vaccinated and then demanding hospital care once they are seriously ill, many people are now forced to miss life saving surgeries and procedures.\n——— \nact.tv is a progressive media company specializing in next generation live streaming and digital strategy. Our YouTube channel focuses on interviews with noted progressive voices, animated explainers, livestreams from protests around the country, and original political commentary.\nMain site: http://act.tv \nFacebook: http://facebook.com/actdottv \nTwitter: http://www.twitter.com/actdottv \nInstagram: http://www.instagram.com/actdottv\nYouTube: https://www.youtube.com/actdottv\nTwitch: https://www.twitch.tv/actdottv\n@act.tv \n#DoMoreThanWatch", "duration": "724", "publish_date": "2021-08-30", "snapshot_pt_time": "2022-05-29-17", "is_streamed": false, "view_count": "2212", "num_like": 375, "num_dislike": 0, "lang": "NA", "transcript": "hello greetings everybody my name is james i am from the internet and today we are going to talk about the performative theater of patriotism now i spent the better part of a decade out in the streets recording live streaming and covering protests riots actions all sorts of things and something that i saw a lot honestly more frequently than i thought i would or should have was people at the end of protests and whatever the hell else happened going up to cops and soldiers or people in fatigues and thanking them for their service and then they you know take their little kids and they huddle up and they have this warm glow about them and they go and they walk off and they'll feel better about themselves you know yeah they they don't actually tell the officer or the soldier that they you know are thanking them for their service because they really care about the service they did they just care about feeling better about themselves look at me i'm the kind of person who thanks somebody in uniform for their service i am truly a moral person i'm glad i got to do that in front of my children and show them just how moral i am so right about now you're thinking i'm a dick because i'm saying that's performative theater well let me show you what thanking people for their service especially on behalf of patriots what it actually looks like in real life beyond the performative theater portion of the show shall we here we go veteran dies of treatable illness as covid phil's hospital beds leaving doctors quote playing musical chairs that's right we're going to hear the story about how an honorable retired us military veteran couldn't even get a bed in a hospital because of all of the unvaccinated people filling up all the beds most of whom are the people who would have thanked him for his service they saw him out in the street in fatigues because they're real patriots and the patriots want you to know that they really really really appreciate your service so much so in fact that they rush out and take all the hospital beds rather than getting a vaccination and then leave you to [ __ ] die don't believe me let's read about it when u.s army veteran daniel wilkinson started feeling sick last week he went to the hospital in belleville texas outside houston his health problem wasn't related to kova 19 but wilkinson needed advanced care and with the coronavirus filling up intensive care beds he couldn't get in in time to save his life quote he loved his country his mother said he served two deployments in afghanistan came home with a purple heart and it was a gallstone that took him out that's right no icu beds anywhere so you know the veteran just got left to sit there and drown in his own juices and slowly die you know because a whole bunch of patriotic people who normally would have thanked him for his service were too busy uh taking all the oxygen all the water all the people and all the resources out of the hospital in the state to serve themselves at the 11th hour after they refused to get vaccinated stop me if you've heard that part of the story before while i continue to read this part a belleville emergency room physician treated wilkinson and discovered that he had gallstone pancreatitis something the belleville hospital wasn't equipped to treat quote i do labs on him i get labs the labs come back and i'm at the computer and i have one of those oh crap moments if that stone doesn't spontaneously come out and doesn't resolve itself that fluid just builds up backs up into the liver backs up into the pancreas and starts to shut down those organs his blood work even showed that his kidneys were shutting down well if only in the land of the greatest health care system in the world a decorated us veteran was able to get the medical care needed to cure an easily curable illness but you know unfortunately all the patriotic people with no vaccines taking up all the bads and the hospital resources and yeah that sort of thing so tough luck there decorated veteran dude you should have been more patriotic and just not gotten a vaccination and then you know got admitted to the hospital last week to get some oxygen with the rest of the dicks who didn't bother to get vaccinated then you could have had a bed the doctor recalled making multiple phone calls to other facilities only to get a lot of sorry sorry sorry in reply other places had the specialist to do the procedure but because of how sick he was wilkinson needed intensive care and they didn't have an icu bed to put him in quote then i'm at my computer and i'm scratching my head and i get this thought like what if i put this on facebook or something maybe somebody can help out one doctor messaged me hey i'm in missouri last time i checked we have icu beds we can do this call this number next guy messages me he's a gi specialist he goes i'm in austin i can do this procedure get him over i said okay great let's go then he texted me back five minutes later i'm sorry i can't get administrative approval to accept him because we're full now i would like for you all to keep in mind that this doctor a medical professional working in an actual hospital in the united states of america as part of the greatest health care system in the world was forced to go on a facebook group and make a post and beg for the life of his patient a decorated us veteran who didn't have covet to get an icu bed and to get treatment so that he didn't die from an easily treatable illness if only there were some icu beds available if only there were some people who were so patriotic that they would give a [ __ ] about their other 330 million american brothers and sisters you know all the other people who live in this country who might need access to medical care yeah but you know [ __ ] all those people right man if only there was like some kind of a medical procedure or a wonder drug or something that people could just all take and then it would stop spreading the virus around a lot and people wouldn't get us sick and you know then the hospitals wouldn't get full man we really shouldn't invent something like that shouldn't we ah for nearly seven hours wilkinson waited in an er bed at belleville quote i had that thought in my head i need to get his mother here right now i said if he doesn't get this procedure done he is going to die they knew he was going to die the doctor knew the hospital knew all of the other doctors and hospitals that he contacted on a facebook group and through a text chain they all knew that this decorated army veteran was going to die if he didn't get a simple procedure in the next few hours and nobody not one could find him a bed because of all the fine upstanding patriotic unvaccinated americans taking up all the icu beds sucking up all the resources because god damn it that's patriotism what i also had to have the discussion with him dan if your heart stops in front of me right here what do you want me to do do you want me to do everything we can to resuscitate you try to get your heart back if that were to happen dan if i were to get you back we're still in that position we're in right now in other words dan i think more than likely you are going to die but hey don't worry the guy who is willing to die for your freedoms yeah i'm sure he's really happy that you exercised your freedom by not bothering to get vaccinating you know maybe helping other people because [ __ ] those people right that's patriotism finally a bed opened up at the va hospital in houston it was a helicopter ride away the doctor recalled wilkinson saying i promised myself after afghanistan i'd never be in a helicopter again oh well let's go yeah look at superstar lifted to houston but it was already too late quote they weren't able to do the procedure on them because it had been too long they told me they'd seen air pockets in his intestines which means that they were already starting to die off they told me that i had to make a decision and i knew how danny felt he didn't want to be that way and so we were all in agreement that we had to let him go yes all those patriotic americans filling up hospital beds with a garden tube shoved down their throat and a plastic bag taped to their ass practicing their freedom and their patriotism well they're the reason why danny the decorated u.s military veteran had to die the doctor said if it weren't for the coveted crisis the procedure for wilkinson would have taken 30 minutes and then he would have been out the door quote i've never lost a patient from this diagnosis ever we know it needs to be done and we know how to treat it and we get them to where they need to go i'm scared that the next patient that i see is someone that i can't get to where they need to go we're playing musical chairs with a hundred people and ten chairs when the music stops what happens people from all over the world come to houston to get medical care and right now houston can't take care of patients from the next town over that is the reality as of last night there were 102 people waiting for an icu bed in the greater houston area so what does all of this mean to you the average viewer at home or on the go watching this video well to start with it means if you live in a state that has fewer than 60 percent of its people fully vaccinated you better not get sick because if you do there's a better than average chance nobody in your state has a hospital bed available and again it's because of all those highly patriotic people who love their freedom so much that they exercise the freedom to not get vaccinated the freedom to use up all the hospital resources and the freedom to let you go [ __ ] die from easily curable diseases because their freedom means everything including their freedom to kill you now for everybody else out there who might live in a state that has a little bit of breathing room pun intended well this means that no matter where you are you're close to the precipice as well because this is going to get worse before it gets better why well because we've demanded that everything be reopened fully there's no tele-learning option this year coming up in the fall that's not a [ __ ] thing no no no every single government every single state is demanding that your kids go back to school full-time in the classroom solely so that you the lazy parent at home who's been sitting around caring for their child and homeschooling them for a year and a half yeah they just want you lazy people to get back to work and so this veteran your kids and everybody else in this country well those people those are the sacrifices that the people at the top are willing to make it would seem that we have a top-down problem and it might be time to do a little pruning until next time my name is james i am from the internet and i am out peace ", "num_comment": 43, "comment_list": "NA", "top_comment_list": [{"author_id": "UCGhog19hQ7BCr_4qIx8Dx9Q", "author_name": "Jennifer Bruner", "comment": "You made me cry. I imagine there are more stories like this. I firmly believe that all lives have worth, and I am also coming to the belief that people who have refused vaccination for covid should be the last people allowed to use health care resources. If someone else, like this veteran, needs the space, somebody who has covid due to lack of vaccination should be tossed out. They are killing others by spreading the germs, and now they are killing others by using up resources.", "published_date": "8 months ago", "num_of_replies": null}, {"author_id": "UCltqjdM6fYhhiuPR9zB3FhQ", "author_name": "George Knightley", "comment": "James, I love you! Thank you for what you do. You help to balance out", "published_date": "8 months ago", "num_of_replies": 1}, {"author_id": "UC8_i5Y8dfspDxG_63apIG-g", "author_name": "Eliyahu BenYsrael", "comment": "Clogging the hospital system and making all care unavailable to the general public is a situation that must be publicly addressed and remedied. This cannot be allowed to stand...", "published_date": "8 months ago", "num_of_replies": 2}, {"author_id": "UC_Lu9lFuyzbX4qajuecgOhA", "author_name": "Sweet Lou", "comment": "\"reality must take precedence over public relations, for nature cannot be fooled\" - Richard Feynman", "published_date": "8 months ago", "num_of_replies": null}, {"author_id": "UCIBba4iFZ0BkgylLzsZPafA", "author_name": "Crazy Hawaiian", "comment": "What makes my stomach turn is that Dan is by no means an isolated incident 🥺🥺🥺. There are so many of us out here who try to be kind, we try to do the “right thing”… but it seems to be futile. Just give me a day to lick my wounds… tomorrow I fight once again! 💪🐐🐐🐐✌️", "published_date": "8 months ago", "num_of_replies": 3}, {"author_id": "UCjdg2TcS_HEzMmCYfrFJeLA", "author_name": "Euphonic Studio Recording", "comment": "The return to school is going to be a disaster.  In iowa we just passed the one week mark of the school year.  In two or three weeks everything is going to change because our state passed a no-mask mandate law.  Eventually, that's  not going to stand, and eventually we'll go back to remote learning, and eventually we'll shut down again.  Reality is not going to be kind to trumpists.  But pandemic measures won't be reinstated until it's a complete necessity, which is sadly going to be too late for a lot of kids and parents.  And old people like my wife and me.  Some religious people might interpret this as a Judgement from the Lawd.  It's more like a middle finger from Reality.", "published_date": "8 months ago", "num_of_replies": 4}, {"author_id": "UCBf4QfUraVnyPeaaote4C9w", "author_name": "GetThePitchforks !!!", "comment": "You might want to mention also that because of our for-profit healthcare and our government, we have no reserve capacity for emergencies.", "published_date": "8 months ago", "num_of_replies": 3}, {"author_id": "UCKwyxCeCzZ5q7Pq-PgkLMtA", "author_name": "ᵉˣᵉ.ᴛⁿⁱʳᵖᵗᵒᵒғ_ʟᵃʳⁱᴠ", "comment": "Imagine surviving the military industrial complex, only to end up dying from our country's preventable ignorance.", "published_date": "8 months ago", "num_of_replies": 2}, {"author_id": "UCKwyxCeCzZ5q7Pq-PgkLMtA", "author_name": "ᵉˣᵉ.ᴛⁿⁱʳᵖᵗᵒᵒғ_ʟᵃʳⁱᴠ", "comment": "On a somewhat related note... Imagine just how fkng dumb a person just has to be to intentionally put their kids, the next generation of their bloodlines, in jeopardy though.", "published_date": "8 months ago", "num_of_replies": 1}, {"author_id": "UCBf4QfUraVnyPeaaote4C9w", "author_name": "GetThePitchforks !!!", "comment": "The vaccinated can still catch and spread. PLEASE wear masks! Wear two if you want to be really thorough!", "published_date": "8 months ago", "num_of_replies": null}, {"author_id": "UCtyayrfXlK-agcAiQ8uwNTQ", "author_name": "Achicario", "comment": "Now think about this on a larger scale with car accidents and other things that require emergency care but no bed because all the beds are taken to house all the COVID patients.", "published_date": "8 months ago", "num_of_replies": null}, {"author_id": "UCRmm5nGsw3He04ENSRTjkyg", "author_name": "Jo Nu", "comment": "My dad, who served in the military told me that they would rather have the men come back in body bags because it’s cheaper to put a flag on a grave then to give a veteran healthcare, housing and education or a job!", "published_date": "8 months ago", "num_of_replies": null}, {"author_id": "UCsizHD3L_vafAsV1nrZy-ng", "author_name": "Johnny Angel", "comment": "Greatest health care system in the world... LMAO!  The most expensive, yes.  Also, shame on America (trump) for making this anti-vax stuff way bigger than it should be.  Be a real patriot and take a shot in the arm for your family, neighbors, and veterans.  It doesn't even hurt.  Trust me... I know.  💉", "published_date": "8 months ago", "num_of_replies": null}, {"author_id": "UCwo5VIhWS0qj8KU8SBjJKww", "author_name": "Anthony", "comment": "That doctor should have performed triage -- pulled someone out of ICU who was older and had less chance of surviving covid.  When you're in a position to choose who lives and dies, you have to make that choice based on principles better than \"first come first serve\".", "published_date": "8 months ago (edited)", "num_of_replies": null}, {"author_id": "UCAR68-qQsedY2juJ-QI-exQ", "author_name": "Radical Mainiac", "comment": "Omfg this shit it so sickening.  Thanks James for everything you do. I'm just so fucking sick of these ppl 😒", "published_date": "8 months ago", "num_of_replies": null}, {"author_id": "UCa6u_g9w3F-BOC27Nz3ThfA", "author_name": "Victoria Freeman", "comment": "There’s a lot wrong with our medical system, but that it serves people I don’t agree with isn’t one of them.", "published_date": "8 months ago (edited)", "num_of_replies": null}, {"author_id": "UCZrbsD1JXm_FNEYV-ZCzbWw", "author_name": "Otto Dachat", "comment": "so an indifference to vaccinations, and an adherence against science, makes one wonder if  this recent wave of cases should give us pause, is this Darwin's Law En Masse at work?", "published_date": "8 months ago", "num_of_replies": 1}, {"author_id": "UCQIjMf_tpJx7Zk3eLvWb9sg", "author_name": "Patricio Torres", "comment": "Great video thanks", "published_date": "8 months ago", "num_of_replies": null}, {"author_id": "UCMmFAplAAVU80LXNmEJ0Dqg", "author_name": "Matthew Fusaro", "comment": "It's not just the unvaccinated that are the problem.  I watched the \"Today\" show where they were casually talking about the new MU variant of the coronavirus.  They have very little information about this new variant, yet they say it's in 49 states and yet they discuss it with no masks, no social distancing.  Now I'm sure the hosts on the Today show have been vaccinated but none of them seem to care about what this virus could mutate into.  It's as if the Trump era never ended, the only difference now we have vaccines.  Everyone is in a hurry to pretend like everything is back to normal, and just like last year, that attitude is going to lead to disaster.", "published_date": "8 months ago", "num_of_replies": null}, {"author_id": "UCG3n9bFJ-ZD_4VhliOFlsbQ", "author_name": "Nina", "comment": "Wouldnt getting the vaccine be the most patriotic thing to do for your fellow American. U know protect your neighbor. Guess some people were not raised same way i was", "published_date": "8 months ago", "num_of_replies": null}, {"author_id": "UCYwAqXXgeYxuHoN2IhVUvqQ", "author_name": "Mark Johnson", "comment": "The medical industrial industry has turned back the clock on medical practices in America to about 1830. If you can adjust to that your OK.", "published_date": "8 months ago", "num_of_replies": null}, {"author_id": "UCkjhRm9B7iGFXMh376Thrkw", "author_name": "WTFViewer", "comment": "Also, don't military bases have infirmaries equipped with surgical centers and ICU beds?  If not, WHY !?!?!!  I mean, we have VA hospitals, but every military base has dangers that require such facilities, and those would be critical now, especially for veterans like Dan.  Why FEMA doesn't have a large number of mobile ICU centers is beyond me (especially in the face of hurricanes every year, including Ida which just rolled through Louisiana).", "published_date": "8 months ago", "num_of_replies": 3}, {"author_id": "UCYwAqXXgeYxuHoN2IhVUvqQ", "author_name": "Mark Johnson", "comment": "To build a virus free 'green zone' with positive pressure out of any building. Place a barn fan in a doorway or window facing in. Have it blow thru a micro filter, available in bulk, sock design is best, low speed is best, just a whisper. You'll have to build a simple housing unit, check with your local HVAC people. Tape off all other seams in the building except the fire exits. Make a small opening low somewhere, if outside temps cold or high if they are warm so the air can flow constant When a door is open the air blows out. This build takes about 4 hours. Can be done in any community. IT COULD BE DONE IN KEY FACILITIES LIKE POWER AND WATER PLANTS, BARS, COMEDY CLUBS, CLASSROOMS, everywhere with a positive pressure set up coming in thru the filter. To keep the virus out. When you open the door air flows out. You could modify this for a sick room at home. Put a small fan blowing out in the window of the sick room. Seal the room with tape elsewhere, except the door. Make it a small air flow, just a whisper, mind the heat bill.", "published_date": "8 months ago", "num_of_replies": null}, {"author_id": "UCN2WWQcuy1SsEozFI8QxQhg", "author_name": "Tamara Bartolo", "comment": "Sad!!! I agree with you 100%...", "published_date": "8 months ago (edited)", "num_of_replies": null}, {"author_id": "UCp_FYZ_JQYxoawiV1j_H0ig", "author_name": "S. T. Scott", "comment": "american health administrators played these games with a guy they knew NEEDED a surgeon, they could do it, but business is business so someone, an american military veteran, dies cuz he can't get a 30 minute procedure? 😶", "published_date": "8 months ago", "num_of_replies": null}, {"author_id": "UCCT4MMWnYC5gnGQuQvTACqw", "author_name": "Bonnie Watson", "comment": "Why in the hell didn’t they send him to VA Hospital or send him to another state.", "published_date": "8 months ago", "num_of_replies": 3}, {"author_id": "UC7Q2BmFrLd4X0kGSRb2dQDg", "author_name": "TAX THE CHURCHES", "comment": "Your freedom ends where my begins.", "published_date": "8 months ago", "num_of_replies": null}, {"author_id": "UCpovWUYHV55bgFxsELWmejw", "author_name": "Laurie Reid", "comment": "😢", "published_date": "8 months ago", "num_of_replies": null}, {"author_id": "UCA3h1HQJXAA3J5rLOkHdL6w", "author_name": "Lisa Kukla", "comment": "No more clearing out other wings to make room for more covid patients. If the National Guard wants to come set up tents, that's fine, but the rest of us are going back to normal. We are moving on without you.", "published_date": "8 months ago", "num_of_replies": 1}, {"author_id": "UCkAXU3yNfZDBoNDgVLkWaEQ", "author_name": "Patrick Massonne", "comment": "Man............ Just, Man..................Bingo.", "published_date": "8 months ago", "num_of_replies": null}, {"author_id": "UCxoSgTLuxRteyQSPEm_HdwQ", "author_name": "Tennessee Jed", "comment": "Missed my James time!", "published_date": "8 months ago", "num_of_replies": 4}, {"author_id": "UCqJMfC-oMOWVhn5oIZvcvqw", "author_name": "Melissa Thorpe", "comment": "We have got to get rid of Desantis!!!!", "published_date": "8 months ago", "num_of_replies": null}, {"author_id": "UCo9Lo0P9SRZ5evisBBohg2w", "author_name": "Judith Smith", "comment": "If you’re not vaccinated then hospital needs to turn you away to go celebrate your \"freedom\" AT HOME!", "published_date": "8 months ago", "num_of_replies": 6}, {"author_id": "UC-lQgx_F1nA67A_Bb10RzrA", "author_name": "Mighty Mouse", "comment": "We are the Human Capital Stock 😢", "published_date": "8 months ago", "num_of_replies": 4}, {"author_id": "UCkolM3lktLa852gG7-BP7cA", "author_name": "Donald Ramsey", "comment": "M4A", "published_date": "8 months ago", "num_of_replies": null}, {"author_id": "UCxp_t0dpk6Zg2p8ASaksp-w", "author_name": "Star Tower", "comment": "🍅🍅🍅", "published_date": "8 months ago", "num_of_replies": null}, {"author_id": "UC5sBJqUZTj7lyULFj2PQR7Q", "author_name": "Airith4", "comment": "This is very sad.", "published_date": "8 months ago", "num_of_replies": null}, {"author_id": "UCRQUjRA5dV2rL4UuAA7zzzg", "author_name": "Josh Busfield aka bitterphase", "comment": "mellow greetings, baby", "published_date": "8 months ago", "num_of_replies": null}, {"author_id": "UCbCFkd1uw1YMoLL8zb6J1AQ", "author_name": "Brandon Foster", "comment": "Should have threw unvaccinated out of bed and made them wait.", "published_date": "8 months ago", "num_of_replies": 1}, {"author_id": "UC8KXlIN7RtMeMUTd_EEw4kg", "author_name": "James Mathers", "comment": "Fun story.. tell me another one..", "published_date": "8 months ago", "num_of_replies": 1}, {"author_id": "UCotYO8k8onRV0fsBTHP9w2Q", "author_name": "STR8L8CED", "comment": "Protests lmao....you mean riots.", "published_date": "8 months ago", "num_of_replies": null}, {"author_id": "UC0Y-H50vnw6VRryvmPYp-Xw", "author_name": "elliott betancourt", "comment": "Lol", "published_date": "8 months ago", "num_of_replies": null}, {"author_id": "UCIh8iB-iiaE_aaCpJxz7GCA", "author_name": "Randall Rutherford", "comment": "Dude write a book of everything you ate until now in your life so that everyone can avoid these foods. They got you physically and mentally screwed up.", "published_date": "8 months ago (edited)", "num_of_replies": 13}]}, {"vid": "GlZO3XWRa9k", "title": "Joseph Morelle calls voting restrictions a disgrace", "channel_id": "UC7yoXZ7c8ZZAimgcqHBtHoQ", "category": "News & Politics", "keywords": ["act.tv", "progressive", "media", "company", "activism", "lefty", "politics", "democratic socialism", "video meme", "political video meme", "act.tv tiktok", "@actdottv", "snark", "sarcasm", "#Shorts", "act.tv #Shorts", "act.tv youtube shorts", "joseph morelle", "Joseph Morelle", "voting restrictions", "disgrace", "voter suppression", "vote", "voters rights", "rights", "voters", "voting", "voter restriction laws", "bottle of water", "voter lines", "water bottles", "candy bar", "granola bar", "polling lines", "polling places"], "description": "Joseph Morelle calls voting restrictions a disgrace!  #Shorts #Democrats #Progressive #Vote #VotersRights \n——— \nact.tv is a progressive media company specializing in next generation live streaming and digital strategy. Our YouTube channel focuses on interviews with noted progressive voices, animated explainers, livestreams from protests around the country, and original political commentary.\nMain site: http://act.tv \nFacebook: http://facebook.com/actdottv \nTwitter: http://www.twitter.com/actdottv \nInstagram: http://www.instagram.com/actdottv\nYouTube: https://www.youtube.com/actdottv\nTwitch: https://www.twitch.tv/actdottv\n@act.tv \n#DoMoreThanWatch", "duration": "26", "publish_date": "2021-08-30", "snapshot_pt_time": "2022-05-29-17", "is_streamed": false, "view_count": "2270", "num_like": 85, "num_dislike": 0, "lang": "NA", "transcript": "NA", "num_comment": 4, "comment_list": "NA", "top_comment_list": [{"author_id": "UCPUg8AJGPwHWW-EWC7yAG5w", "author_name": "raul ruiz", "comment": "granny gop gonna stop going to vote", "published_date": "8 months ago", "num_of_replies": null}, {"author_id": "UC0E9Es5enfwnxBuP2fkdOcw", "author_name": "Nobody", "comment": "🤪", "published_date": "8 months ago", "num_of_replies": null}, {"author_id": "UC7Q2BmFrLd4X0kGSRb2dQDg", "author_name": "TAX THE CHURCHES", "comment": "Republican jEbUs said those who would sacrifice 5 hours in line deserve no water nor medicare for all. GQP verses 1:2", "published_date": "8 months ago", "num_of_replies": null}, {"author_id": "UCkSjjN7vTDVkqJ3z_g3B77w", "author_name": "itsnotme 1961", "comment": "You can just get a  Is mail in ballot problem solved", "published_date": "8 months ago", "num_of_replies": 2}]}]}
